In [52]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Assignment on Statistics

In [53]:
data = pd.read_csv('Students_Performance.csv')
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

how many males and females participated in the test?

In [54]:
data['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

Students' parental level of education?

In [55]:
data['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

:- Most of the parents have an colleg education and only few parents have a masters degree

Who scores the most on average for math, reading and writing based on
1.Gender 2. Test preparation course

In [56]:
for i in ['math score','reading score','writing score']:
    average = data.groupby('gender')[i].mean()
    print(average)

gender
female    63.376448
male      68.821577
Name: math score, dtype: float64
gender
female    72.590734
male      65.545643
Name: reading score, dtype: float64
gender
female    72.467181
male      63.446058
Name: writing score, dtype: float64

In [57]:
for i in ['math score','reading score','writing score']:
    average = data.groupby('test preparation course')[i].mean()
    print(average)

test preparation course
completed    69.96648
none         63.78972
Name: math score, dtype: float64
test preparation course
completed    74.175978
none         66.417445
Name: reading score, dtype: float64
test preparation course
completed    74.684358
none         64.457944
Name: writing score, dtype: float64

Scoring variation for math, reading and writing based on
i.
Gender
ii.
Test preparation course

In [58]:
for i in ['math score','reading score','writing score']:
    variance = data.groupby('gender')[i].var()
    print(variance)

gender
female    256.958593
male      211.889097
Name: math score, dtype: float64
gender
female    207.677438
male      200.211010
Name: reading score, dtype: float64
gender
female    220.369327
male      202.413924
Name: writing score, dtype: float64

In [59]:
data[['gender', 'math score', 'reading score', 'writing score']].groupby('gender').std()

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

In [60]:
for i in ['math score','reading score','writing score']:
    variance = data.groupby('test preparation course')[i].var()
    print(variance)

test preparation course
completed    210.884027
none         246.668662
Name: math score, dtype: float64
test preparation course
completed    183.265864
none         213.419851
Name: reading score, dtype: float64
test preparation course
completed    175.202612
none         226.251739
Name: writing score, dtype: float64

In [61]:
data[['test preparation course', 'math score', 'reading score', 'writing score']].groupby('test preparation course').std()

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

The top 25% of students based on their math score

In [62]:
#data['math score'].quantile(0.25)

In [63]:
#data.sort_values(by=['math score'],ascending=False).head(int(len(data['math score'])*(25/100)))

In [64]:
data.nlargest(250, ['math score'])

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62

# Case Study on Testing of Hypothesis

In [65]:
import scipy.stats as stats
from statsmodels.stats.weightstats import ztest
import statsmodels.api as sm
from statsmodels.formula.api import ols

In [66]:
df = pd.read_csv('Sales_add.csv')
df

,Month,Region,Manager,Sales_before_digital_add(in $),Sales_After_digital_add(in $)
0,Month-1,Region - A,Manager - A,132921,270390
1,Month-2,Region - A,Manager - C,149559,223334
2,Month-3,Region - B,Manager - A,146278,244243
3,Month-4,Region - B,Manager - B,152167,231808
4,Month-5,Region - C,Manager - B,159525,258402
5,Month-6,Region - A,Manager - B,137163,256948
6,Month-7,Region - C,Manager - C,130625,222106
7,Month-8,Region - A,Manager - A,131140,230637
8,Month-9,Region - B,Manager - C,171259,226261
9,Month-10,Region - C,Manager - B,141956,193735
10,Month-11,Region - B,Manager - C,159339,203175
11,Month-12,Region - A,Manager - A,178939,276279
12,Month-13,Region - B,Manager - A,145062,205180
13,Month-14,Region - A,Manager - A,151514,253131
14,Month-15,Region - C,Manager - A,147463,229336
15,Month-16,Region - A,Manager - B,177195,187305
16,Month-17,Region - A,Manager - C,140862,234908
17,Month-18,Region - C,Manager - B,167996,191517
18,Month-19,Region - B,Manager - A,132135,227040
19,Month-20,Region - A,Manager - B,152493,212579
20,Month-21,Region - B,Manager - A,147425,263388
21,Month-22,Region - A,Manager - C,130263,243020

In [67]:
df.rename(columns = {'Sales_After_digital_add(in $)' : 'Sales_After_digital_add'}, inplace = True)

In [68]:
df.columns

Index(['Month', 'Region', 'Manager', 'Sales_before_digital_add(in $)',
       'Sales_After_digital_add'],
      dtype='object')

In [69]:
alpha = 0.05

t_val,p_val = stats.ttest_rel(df['Sales_before_digital_add(in $)'],df['Sales_After_digital_add'])
print(p_val)

6.336667004575778e-11

In [70]:
if p_val < alpha:
    print('Reject null hypothesis: The digital marketing strategy has increased sales')
else :
    print('Do not reject null hypothesis: The digital marketing startegy didnot increase sales')

Reject null hypothesis: The digital marketing strategy has increased sales

Dependency between the features “Region” and “Manager”.

In [71]:
model = ols('Sales_After_digital_add ~ C(Region) + C(Manager) +C(Region):C(Manager)',data = df).fit()
#model = ols('height ~ C(water) + C(sun) +C(water):C(sun)',data=df).fit()
anova_table = sm.stats.anova_lm(model, typ = 2)
print(anova_table)

                            sum_sq    df         F    PR(>F)
C(Region)             1.114049e+09   2.0  0.810150  0.466032
C(Manager)            2.568861e+09   2.0  1.868109  0.193579
C(Region):C(Manager)  8.388157e+08   4.0  0.304999  0.869479
Residual              8.938238e+09  13.0       NaN       NaN

In [72]:
#import patsy
#patsy.__version__

In [73]:
alpha = 0.05

if any(anova_table['PR(>F)'] < alpha):
  print('There is significant interaction between factors')
    
  region = anova_table.loc['C(Region)', 'PR(>F)'] < alpha
  manager = anova_table.loc['C(Manager)','PR(>F)'] < alpha
    
  if region:
        print('region has significant effect')
  else:
        print('region has no significant effect')
        
  if manager:
        print('manager has significant effect')
  else:
        print('manager has no significant effect')
        
else :
    print('No significant interaction between the factors')

No significant interaction between the factors